{
  "backend/main.mo": "Actor managing user profiles, replies, and access control with permission checks and default reply handling.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files and components.",
  "frontend/BUILD_DEPLOY_RETRY_NOTES.md": "Deployment retry notes detailing assets, build steps, and expected app behavior.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables and global theming for light/dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main app component controlling navigation between landing, overlay, gratitude, reply, and farewell pages.",
  "frontend/src/components/EvasiveNoButton.tsx": "Button component that dodges user interaction and shows a temporary warning popup.",
  "frontend/src/components/RomanticNotificationOverlay.tsx": "Full-screen romantic overlay with animated hearts, sparkles, and dismiss button.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing authenticated/anonymous backend actors with access control initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useReplyPersistence.ts": "Uses react-query and an actor to load and save a user's reply, exposing loading, saving, and error states.",
  "frontend/src/index.css": "Tailwind config defining Valentine-themed colors, animations, gradients, and component styles for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/FarewellPage.tsx": "Displays a farewell message with animated emojis, themed styling, and a footer credit link.",
  "frontend/src/pages/GratitudePage.tsx": "Shows a gratitude-themed page with animated hearts, decorative visuals, and a next-step button callback.",
  "frontend/src/pages/LandingPage.tsx": "Renders a Valentine-themed landing screen with animated hearts and a yes/no prompt using an evasive 'No' button.",
  "frontend/src/pages/ReplyPage.tsx": "A React page showing a reply textarea with in-place editing, saving via a persistence hook, and a Next button for navigation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, shadows, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing existing features, pending requests, and overall app flow."
}