{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report linking background-image updates for landing and gratitude pages to specific frontend source files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each major frontend file.",
  "frontend/BUILD_DEPLOY_RETRY_NOTES.md": "Notes documenting a retry deployment attempt, asset checks, build commands, and expected application behavior.",
  "frontend/index.css": "Tailwind base layer defining a Valentine's-themed OKLCH color palette and dark mode variants with global styling.",
  "frontend/index.html": "Basic HTML shell containing a root div and script entry for loading the React application.",
  "frontend/src/App.tsx": "Top-level component toggling between LandingPage and GratitudePage based on internal state.",
  "frontend/src/components/EvasiveNoButton.tsx": "Interactive 'No' button that randomly repositions within its container on user interaction.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance, updating when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/index.css": "Enhanced Tailwind styles with Valentine's color tokens, gradients, and custom heart animations.",
  "frontend/src/main.tsx": "React entry point that sets up providers for React Query and Internet Identity before rendering App.",
  "frontend/src/pages/GratitudePage.tsx": "React page showing a gratitude message with floating heart decorations and a full-page background image. Includes animated icons, themed text, and structured sections for visuals and messages.",
  "frontend/src/pages/LandingPage.tsx": "Landing page asking a love question with Yes and evasive No buttons, using themed heart visuals and a full-page background image. Handles the Yes click via a callback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, shadows, and animations, and enabling plugins like typography and container queries. Defines custom Valentine-themed colors and effects.",
  "project_state.json": "Project metadata describing requirements, issues, and features for a Valentine-themed two-page site. Notes background image requirements and current deployment issues."
}