{
  "kind": "build_request",
  "title": "Use uploaded images as full-page backgrounds on Landing and Gratitude pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Update the Landing page so the uploaded image at `/assets/3a6059bf59d32f6f27e0496b5424853a.jpg` is used as a full-page background image behind all existing content (not just rendered as an inline image). The background must cover the viewport (CSS cover/center), remain fixed behind the UI layer, and must not break the Yes/No button layout or the evasive behavior of the No button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No I need the uploaded images as background images"
        ]
      },
      "acceptanceCriteria": [
        "On the Landing page, the visible page background uses `/assets/3a6059bf59d32f6f27e0496b5424853a.jpg` and fills the viewport using cover/center styling.",
        "All existing Landing page foreground UI remains visible above the background (proper stacking via z-index / positioning).",
        "The No button remains fully interactive and continues to evade on hover/mousedown/touchstart without being blocked by the background layer.",
        "The Yes button still works and still navigates to the Gratitude page."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the Gratitude page so the uploaded image at `/assets/2fe29e3f61a6e53093c503c181238cdc.jpg` is used as a full-page background image behind all existing content. The background must cover the viewport (CSS cover/center) and remain behind the page content without reducing readability or breaking layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No I need the uploaded images as background images"
        ]
      },
      "acceptanceCriteria": [
        "On the Gratitude page, the visible page background uses `/assets/2fe29e3f61a6e53093c503c181238cdc.jpg` and fills the viewport using cover/center styling.",
        "All existing Gratitude page content renders above the background and remains readable (e.g., via existing styling or a subtle overlay if needed).",
        "No changes break navigation flow (Landing → Gratitude)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (read-only).",
    "Do not change the backend (Motoko) behavior or require backend image serving; all images must be loaded as static frontend assets via `/assets/...`.",
    "Keep the existing Yes/No interaction behavior and page navigation intact."
  ],
  "nonGoals": [
    "Adding new pages or new user flows.",
    "Introducing new image assets beyond the already-uploaded background images.",
    "Implementing authentication, persistence, or any backend functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}