{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Set uploaded images as full-page backgrounds for Landing and Gratitude pages",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Use the uploaded Landing image as a fixed, full-viewport background behind all existing Landing content without affecting Yes/No interactions.",
      "acceptanceCriteria": [
        "On the Landing page, the visible page background uses `/assets/3a6059bf59d32f6f27e0496b5424853a.jpg` and fills the viewport using cover/center styling.",
        "All existing Landing page foreground UI remains visible above the background (proper stacking via z-index / positioning).",
        "The No button remains fully interactive and continues to evade on hover/mousedown/touchstart without being blocked by the background layer.",
        "The Yes button still works and still navigates to the Gratitude page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Replace the current inline rendering of `/assets/3a6059bf59d32f6f27e0496b5424853a.jpg` with a full-page background layer using that same static asset. Implement as a fixed/absolute background element behind all content (cover/center), ensure correct stacking (foreground above via z-index) and ensure the background layer cannot intercept pointer events so the EvasiveNoButton remains fully interactive."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the root wrapper styling so it does not visually override page-specific full-page background images (e.g., remove/neutralize the `valentine-gradient` background on the app shell while keeping the existing Landing → Gratitude navigation logic unchanged)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Use the uploaded Gratitude image as a full-viewport background behind Gratitude content while preserving readability and layout.",
      "acceptanceCriteria": [
        "On the Gratitude page, the visible page background uses `/assets/2fe29e3f61a6e53093c503c181238cdc.jpg` and fills the viewport using cover/center styling.",
        "All existing Gratitude page content renders above the background and remains readable (e.g., via existing styling or a subtle overlay if needed).",
        "No changes break navigation flow (Landing → Gratitude)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GratitudePage.tsx",
          "operation": "modify",
          "description": "Replace the current inline rendering of `/assets/2fe29e3f61a6e53093c503c181238cdc.jpg` with a full-page background layer using that static asset (cover/center). Ensure the background stays behind all content via z-index/positioning, and add/adjust a subtle non-interactive overlay layer if needed to maintain text readability without changing the page layout."
        }
      ]
    }
  ]
}